Chapter04/recipe-2/formality/app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
---
  def edit
    # For this tutorial, always edit the first user
    @user = User.first || User.create!(email: '', password: '', timezone: '', public: false, date_of_birth: nil)

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "timezone" = 'America/Indiana/Marengo', "date_of_birth" = '2980-09-19', "updated_at" = '2025-07-13 17:44:11.099759' WHERE "users"."id" = 1
---
  def update
    @user = User.first
    if @user.update(user_params)